; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v4 ?v3)
             (pred_1 ?v13 ?v8)
             (pred_4 ?v4 ?v8)
             (pred_10 ?v12 ?v4 )
	     (pred_8 ?v4)
             (pred_2 ?v11)
             (pred_6 ?v13)
             (pred_5 ?v8)
             (pred_7 ?v4)
             (pred_3 ?v13)
             (pred_9 ?v4)
             (pred_11 ))



(:action op_4
:parameters (?v2 ?v10 ?v9 ?v5)
:precondition (and (pred_2 ?v2) (pred_2 ?v10) (pred_6 ?v9) (pred_5 ?v5)
          (pred_12 ?v2 ?v10) (pred_1 ?v9 ?v5)
                   (pred_4 ?v10 ?v5) (pred_8 ?v2) 
                   (pred_7 ?v10) (pred_3 ?v9))
:effect (and  (pred_9 ?v10) (not (pred_7 ?v10))))


(:action op_1
:parameters (?v2 ?v6)
:precondition (and (pred_2 ?v2) (pred_2 ?v6)
               (pred_8 ?v2) (pred_12 ?v2 ?v6) (pred_9 ?v6))
:effect (and (pred_8 ?v6) (not (pred_8 ?v2))))

(:action op_3
:parameters (?v2 ?v9)
:precondition (and (pred_2 ?v2) (pred_6 ?v9) 
                  (pred_8 ?v2) (pred_10 ?v9 ?v2) (pred_11 ))
:effect (and (pred_3 ?v9)
   (not (pred_10 ?v9 ?v2)) (not (pred_11 ))))


(:action op_2
:parameters (?v2 ?v1 ?v7)
:precondition (and (pred_2 ?v2) (pred_6 ?v1) (pred_6 ?v7)
                  (pred_8 ?v2) (pred_3 ?v7) (pred_10 ?v1 ?v2))
:effect (and (pred_3 ?v1) (pred_10 ?v7 ?v2)
        (not (pred_3 ?v7)) (not (pred_10 ?v1 ?v2))))

(:action op_5
:parameters (?v2 ?v9)
:precondition (and (pred_2 ?v2) (pred_6 ?v9) 
                  (pred_8 ?v2) (pred_3 ?v9))
:effect (and (pred_11 ) (pred_10 ?v9 ?v2) (not (pred_3 ?v9)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_09 obj_13 obj_32 obj_19 obj_05 obj_12 obj_04 obj_08 obj_30 obj_29 obj_24 obj_26 obj_20 obj_31 obj_03 obj_18 obj_21 obj_28 obj_27 obj_11 obj_01 obj_25 obj_16 obj_14 obj_10
    obj_17 obj_22 obj_02
    obj_07 obj_06 obj_23 obj_15
    )

    (:init
       (pred_11)

       (pred_2 obj_09)
       (pred_2 obj_13)
       (pred_2 obj_32)
       (pred_2 obj_19)
       (pred_2 obj_05)
       (pred_2 obj_12)
       (pred_2 obj_04)
       (pred_2 obj_08)
       (pred_2 obj_30)
       (pred_2 obj_29)
       (pred_2 obj_24)
       (pred_2 obj_26)
       (pred_2 obj_20)
       (pred_2 obj_31)
       (pred_2 obj_03)
       (pred_2 obj_18)
       (pred_2 obj_21)
       (pred_2 obj_28)
       (pred_2 obj_27)
       (pred_2 obj_11)
       (pred_2 obj_01)
       (pred_2 obj_25)
       (pred_2 obj_16)
       (pred_2 obj_14)
       (pred_2 obj_10)
       (pred_5 obj_17)
       (pred_5 obj_22)
       (pred_5 obj_02)
       (pred_6 obj_07)
       (pred_6 obj_06)
       (pred_6 obj_23)
       (pred_6 obj_15)

       (pred_12 obj_09 obj_12)
       (pred_12 obj_09 obj_13)
       (pred_12 obj_13 obj_04)
       (pred_12 obj_13 obj_32)
       (pred_12 obj_13 obj_09)
       (pred_12 obj_32 obj_08)
       (pred_12 obj_32 obj_19)
       (pred_12 obj_32 obj_13)
       (pred_12 obj_19 obj_30)
       (pred_12 obj_19 obj_05)
       (pred_12 obj_19 obj_32)
       (pred_12 obj_05 obj_29)
       (pred_12 obj_05 obj_19)
       (pred_12 obj_12 obj_24)
       (pred_12 obj_12 obj_04)
       (pred_12 obj_12 obj_09)
       (pred_12 obj_04 obj_26)
       (pred_12 obj_04 obj_08)
       (pred_12 obj_04 obj_13)
       (pred_12 obj_04 obj_12)
       (pred_12 obj_08 obj_20)
       (pred_12 obj_08 obj_30)
       (pred_12 obj_08 obj_32)
       (pred_12 obj_08 obj_04)
       (pred_12 obj_30 obj_31)
       (pred_12 obj_30 obj_29)
       (pred_12 obj_30 obj_19)
       (pred_12 obj_30 obj_08)
       (pred_12 obj_29 obj_03)
       (pred_12 obj_29 obj_05)
       (pred_12 obj_29 obj_30)
       (pred_12 obj_24 obj_18)
       (pred_12 obj_24 obj_26)
       (pred_12 obj_24 obj_12)
       (pred_12 obj_26 obj_21)
       (pred_12 obj_26 obj_20)
       (pred_12 obj_26 obj_04)
       (pred_12 obj_26 obj_24)
       (pred_12 obj_20 obj_28)
       (pred_12 obj_20 obj_31)
       (pred_12 obj_20 obj_08)
       (pred_12 obj_20 obj_26)
       (pred_12 obj_31 obj_27)
       (pred_12 obj_31 obj_03)
       (pred_12 obj_31 obj_30)
       (pred_12 obj_31 obj_20)
       (pred_12 obj_03 obj_11)
       (pred_12 obj_03 obj_29)
       (pred_12 obj_03 obj_31)
       (pred_12 obj_18 obj_01)
       (pred_12 obj_18 obj_21)
       (pred_12 obj_18 obj_24)
       (pred_12 obj_21 obj_25)
       (pred_12 obj_21 obj_28)
       (pred_12 obj_21 obj_26)
       (pred_12 obj_21 obj_18)
       (pred_12 obj_28 obj_16)
       (pred_12 obj_28 obj_27)
       (pred_12 obj_28 obj_20)
       (pred_12 obj_28 obj_21)
       (pred_12 obj_27 obj_14)
       (pred_12 obj_27 obj_11)
       (pred_12 obj_27 obj_31)
       (pred_12 obj_27 obj_28)
       (pred_12 obj_11 obj_10)
       (pred_12 obj_11 obj_03)
       (pred_12 obj_11 obj_27)
       (pred_12 obj_01 obj_25)
       (pred_12 obj_01 obj_18)
       (pred_12 obj_25 obj_16)
       (pred_12 obj_25 obj_21)
       (pred_12 obj_25 obj_01)
       (pred_12 obj_16 obj_14)
       (pred_12 obj_16 obj_28)
       (pred_12 obj_16 obj_25)
       (pred_12 obj_14 obj_10)
       (pred_12 obj_14 obj_27)
       (pred_12 obj_14 obj_16)
       (pred_12 obj_10 obj_11)
       (pred_12 obj_10 obj_14)
       (pred_7 obj_32)
       (pred_7 obj_20)
       (pred_7 obj_12)
       (pred_7 obj_29)
       (pred_4  obj_32 obj_17)
       (pred_4  obj_20 obj_22)
       (pred_4  obj_12 obj_02)
       (pred_4  obj_29 obj_17)
       (pred_9 obj_09)
       (pred_9 obj_13)
       (pred_9 obj_19)
       (pred_9 obj_05)
       (pred_9 obj_04)
       (pred_9 obj_08)
       (pred_9 obj_30)
       (pred_9 obj_24)
       (pred_9 obj_26)
       (pred_9 obj_31)
       (pred_9 obj_03)
       (pred_9 obj_18)
       (pred_9 obj_21)
       (pred_9 obj_28)
       (pred_9 obj_27)
       (pred_9 obj_11)
       (pred_9 obj_01)
       (pred_9 obj_25)
       (pred_9 obj_16)
       (pred_9 obj_14)
       (pred_9 obj_10)

       (pred_1  obj_07 obj_17)
       (pred_1  obj_06 obj_22)
       (pred_1  obj_23 obj_02)
       (pred_1  obj_15 obj_17)
       (pred_10 obj_07 obj_25)
       (pred_10 obj_06 obj_13)
       (pred_10 obj_23 obj_25)
       (pred_10 obj_15 obj_14)
       (pred_8 obj_08)
    )

    (:goal (and
       (pred_10 obj_23 obj_10)
       (pred_10 obj_15 obj_25)
    ))
(:constraints
  (always (not (pred_8 obj_16)))
)
)

; plan
1. (op_1 obj_08 obj_04)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_04)
   goals met: 0 of 2
2. (op_1 obj_04 obj_26)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_26)
   goals met: 0 of 2
3. (op_1 obj_26 obj_21)
   deleted: (pred_8 obj_26)
   added: (pred_8 obj_21)
   goals met: 0 of 2
4. (op_1 obj_21 obj_25)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_25)
   goals met: 0 of 2
5. (op_3 obj_25 obj_23)
   deleted: (pred_10 obj_23 obj_25) (pred_11)
   added: (pred_3 obj_23)
   goals met: 0 of 2
6. (op_1 obj_25 obj_21)
   deleted: (pred_8 obj_25)
   added: (pred_8 obj_21)
   goals met: 0 of 2
7. (op_1 obj_21 obj_28)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_28)
   goals met: 0 of 2
8. (op_1 obj_28 obj_27)
   deleted: (pred_8 obj_28)
   added: (pred_8 obj_27)
   goals met: 0 of 2
9. (op_1 obj_27 obj_14)
   deleted: (pred_8 obj_27)
   added: (pred_8 obj_14)
   goals met: 0 of 2
10. (op_1 obj_14 obj_10)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_10)
   goals met: 0 of 2
11. (op_5 obj_10 obj_23)
   deleted: (pred_3 obj_23)
   added: (pred_11) (pred_10 obj_23 obj_10)
   goals met: 1 of 2
12. (op_1 obj_10 obj_14)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_14)
   goals met: 1 of 2
13. (op_3 obj_14 obj_15)
   deleted: (pred_10 obj_15 obj_14) (pred_11)
   added: (pred_3 obj_15)
   goals met: 1 of 2
14. (op_1 obj_14 obj_27)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_27)
   goals met: 1 of 2
15. (op_1 obj_27 obj_28)
   deleted: (pred_8 obj_27)
   added: (pred_8 obj_28)
   goals met: 1 of 2
16. (op_1 obj_28 obj_21)
   deleted: (pred_8 obj_28)
   added: (pred_8 obj_21)
   goals met: 1 of 2
17. (op_1 obj_21 obj_25)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_25)
   goals met: 1 of 2
18. (op_2 obj_25 obj_07 obj_15)
   deleted: (pred_3 obj_15) (pred_10 obj_07 obj_25)
   added: (pred_3 obj_07) (pred_10 obj_15 obj_25)
   goals met: 2 of 2
